src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОсмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Направление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчередьНаЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профосмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйПрием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Потенциальный</Name>
					<Comment>Потенциальный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
					<Comment>Новый пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВернувшийся</Name>
					<Comment>Невернувшийся пациент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
					<Comment>Постоянный клиент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыПрофосмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПрофосмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
					<Comment>Запланирован</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласился</Name>
					<Comment>Согласился</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапомнитьПозже</Name>
					<Comment>Напомнить позже</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказался</Name>
					<Comment>Отказался</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Профосмотры/Ext/RecordSetModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Перед записью
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина  Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;	
	
	ИнициализироватьПредопределеннуюСделку();
	
КонецПроцедуры

// Процедура - При записи
//
// Параметры:
//  Отказ		 - 	 - 
//  Замещение	 - 	 - 
//
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка = Истина  Тогда 
		Возврат;
	КонецЕсли;	

	Если НЕ ЭтотОбъект.Количество() = 0 И НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "СсылкаНовойСделки", Неопределено) = Неопределено Тогда
		ДанныеЗаполнения = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ЭтотОбъект.ДополнительныеСвойства));
		ДанныеЗаполнения.Вставить("ВидСделки"				, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));
		ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"		, ЭтотОбъект[0].СтруктурнаяЕдиница);
		ДанныеЗаполнения.Вставить("Контрагент"				, ЭтотОбъект[0].Контрагент);		
		ДанныеЗаполнения.Вставить("ЭтапСделки"				, Справочники.ЭтапыСделок.ПолучитьЭтапПоНомеру(ДанныеЗаполнения.ВидСделки, 1));
		Если ЗначениеЗаполнено(ЭтотОбъект[0].Сотрудник) Тогда 
			ДанныеЗаполнения.Вставить("Врач"				, ЭтотОбъект[0].Сотрудник);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ВидОсмотра"				, ЭтотОбъект[0].ВидОсмотра);				
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление ИЛИ ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда 
			ДанныеЗаполнения.Вставить("Специализация"		, ЭтотОбъект[0].Специализация);
			ДанныеЗаполнения.Вставить("Описание"			, СформироватьОписаниеСделки(ЭтотОбъект[0].ВидОсмотра));			
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ПредыдущийПрием"			, ЭтотОбъект[0].Прием);
		ДанныеЗаполнения.Вставить("СтатусПациента"			, ?(ЗначениеЗаполнено(ЭтотОбъект[0].Прием) И ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Прием, "Проведен"), Перечисления.СтатусыКонтрагентов.Постоянный, Перечисления.СтатусыКонтрагентов.Первичный));
		ДанныеЗаполнения.Вставить("ИнтерактивнаяЗапись"		, Истина);
		ДанныеЗаполнения.Вставить("СформироватьНаименование", Истина);
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием ИЛИ ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда
			ДанныеЗаполнения.Вставить("СгенерироватьЗадачу"	, Истина);
		КонецЕсли;
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда
			ДанныеЗаполнения.Вставить("НаправившийВрач"		, ЭтотОбъект[0].НаправившийВрач);
		КонецЕсли;	
		
		НоваяСделка = Справочники.Сделки.СоздатьНовуюСделку(ДанныеЗаполнения, Истина);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Инициализировать предопределенную сделку
//
Процедура ИнициализироватьПредопределеннуюСделку()
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект[0].Сделка)
		ИЛИ НЕ (ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление ИЛИ ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием)
		ИЛИ ЭтотОбъект[0].Статус = Перечисления.СтатусыПрофосмотров.Отказался Тогда 
		Возврат;
	ИначеЕсли ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись) Тогда 
		СделкаПЗ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].ПредварительнаяЗапись, "Сделка");	
		Если ЗначениеЗаполнено(СделкаПЗ) Тогда 
			ЭтотОбъект[0].Сделка = СделкаПЗ;
			ЭтотОбъект[0].Статус = Перечисления.СтатусыПрофосмотров.Согласился;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	МассивСделокИсключения = Неопределено;
	Если ЗначениеЗаполнено(ЭтотОбъект[0].Прием) Тогда 
		СделкаПриема = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Прием, "Сделка");
		Если ЗначениеЗаполнено(СделкаПриема) Тогда 
			МассивСделокИсключения = Новый Массив;
			МассивСделокИсключения.Добавить(СделкаПриема);
		КонецЕсли;	
	КонецЕсли;	
	
	Записан = ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись);
	ЭтотОбъект[0].Сделка = Справочники.Сделки.ИнициализироватьПредопределеннуюСделку(ЭтотОбъект[0].Контрагент
																					, ЭтотОбъект[0].СтруктурнаяЕдиница
																					, ЭтотОбъект[0].Сотрудник
																					, ЭтотОбъект[0].Специализация
																					, ЭтотОбъект[0].ВидОсмотра
																					, Записан
																					, 
																					, 
																					, МассивСделокИсключения);
															
	Если ЗначениеЗаполнено(ЭтотОбъект[0].Сделка) Тогда
		Если Записан И НЕ ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись) Тогда
			ЭтотОбъект[0].ПредварительнаяЗапись = Документы.Событие.ПолучитьПредварительнуюЗаписьПоСделке(ЭтотОбъект[0].Сделка);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПредварительнаяЗапись", ЭтотОбъект[0].ПредварительнаяЗапись);
			Если ЗначениеЗаполнено(ЭтотОбъект[0].ПредварительнаяЗапись) Тогда 
				ЭтотОбъект[0].Статус = Перечисления.СтатусыПрофосмотров.Согласился;
			КонецЕсли;	
		КонецЕсли;	
		Если ЭтотОбъект[0].ВидОсмотра = Перечисления.ВидыОсмотров.Направление И (ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].ПричинаНаправления)) ИЛИ ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].Комментарий))) Тогда 
			Если НЕ ЗначениеЗаполнено(СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Сделка, "Описание"))) Тогда
				АктуализироватьОписаниеСделки(ЭтотОбъект[0].ВидОсмотра);
			КонецЕсли;	
		КонецЕсли;	
		Возврат;
	КонецЕсли;
	
	// Помещаем ссылку, генерируемой сделки
	СсылкаНовойСделки = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СсылкаНовойСделки", СсылкаНовойСделки);
	ЭтотОбъект[0].Сделка = СсылкаНовойСделки;				
	
КонецПроцедуры

// Процедура - Актуализировать описание сделки
//
Процедура АктуализироватьОписаниеСделки(ВидОсмотра)
	
	Если ЭтотОбъект.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;

	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Попытка
			Сделка_Объект = ЭтотОбъект[0].Сделка.ПолучитьОбъект();
			Сделка_Объект.Описание = СформироватьОписаниеСделки(ВидОсмотра);
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(Сделка_Объект);
		Исключение
			
		КонецПопытки;	
	#КонецЕсли  
	
КонецПроцедуры

// Функция - Сформировать описание сделки
// 
// Возвращаемое значение:
//   - 
//
Функция СформироватьОписаниеСделки(ВидОсмотра)
	
	Если ЭтотОбъект.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВидОсмотра = Перечисления.ВидыОсмотров.ПовторныйПрием Тогда
		Описание = НСтр("ru='Пациент продолжает лечение, запишите на повторный приём.';en='The patient is continuing treatment, make an appointment for a follow-up appointment.'");		
		Возврат Описание 	+ ?(ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].Комментарий))		, Символы.ПС + СокрЛП(ЭтотОбъект[0].Комментарий)		, "");			
	ИначеЕсли ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда	
		НаименованиеВрача = ?(ЗначениеЗаполнено(ЭтотОбъект[0].НаправившийВрач)
							, ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].НаправившийВрач, "НаименованиеСокращенное")
							, СокрЛП(Строка(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект[0].Прием, "Сотрудник"))));
		Описание = СтрШаблон(НСтр("ru='По направлению от %1';en='In the direction from %1'"), НаименованиеВрача);
		Возврат Описание 	+ ?(ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].ПричинаНаправления))	, Символы.ПС + СокрЛП(ЭтотОбъект[0].ПричинаНаправления)	, "")
							+ ?(ЗначениеЗаполнено(СокрЛП(ЭтотОбъект[0].Комментарий))		, Символы.ПС + СокрЛП(ЭтотОбъект[0].Комментарий)		, "");			
	КонецЕсли;
					
КонецФункции

#КонецОбласти
